# Custom YOLOv8 object detection model with P2-P5 outputs and optimized blocks

# Parameters
nc: 4  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.25, 0.25, 1024]  # nano
  s: [0.50, 0.50, 1024]  # small  
  m: [0.75, 0.75, 768]   # medium
  l: [1.00, 1.00, 512]   # large
  x: [1.25, 1.25, 512]   # xlarge

# Optimized backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2

  - [-1, 1, ADSConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C3Ghost, [128, True]]  # 2

  - [-1, 1, ADSConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C3Ghost, [256, True]]  # 4

  - [-1, 1, ADSConv, [512, 3, 2]]  # 5-P4/16 
  - [-1, 6, C3Ghost, [512, True]]  # 6

  - [-1, 1, ADSConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C3Ghost, [1024, True]]  # 8
  
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Enhanced head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  - [-1, 3, C3Ghost, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 3, C3Ghost, [256]]  # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 2], 1, Concat, [1]]  # 17 cat backbone P2
  - [-1, 3, C3Ghost, [128]]  # 18 (P2/4-xsmall)

  - [-1, 1, ADSConv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20 cat head P3
  - [-1, 3, C3Ghost, [256]]  # 21 (P3/8-small)

  - [-1, 1, ADSConv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23 cat head P4
  - [-1, 3, C3Ghost, [512]]  # 24 (P4/16-medium)

  - [-1, 1, ADSConv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]  # 26 cat head P5
  - [-1, 3, C3Ghost, [1024]]  # 27 (P5/32-large)

  - [[18, 21, 24, 27], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)